Revit 2027 API
EdgeArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual EdgeArrayIterator ForwardIterator()
Public Overridable Function ForwardIterator As EdgeArrayIterator
public:
virtual EdgeArrayIterator^ ForwardIterator()
abstract ForwardIterator : unit -> EdgeArrayIterator
override ForwardIterator : unit -> EdgeArrayIterator
Return Value
EdgeArrayIterator
Returns a forward moving iterator to the array.
See Also
Reference
EdgeArray Class
Autodesk.Revit.DB Namespace